'''a = 'This string is very big'
s = a[1:4] # У символов в строке есть свои индексы, символы начинаются с индекса 0
print('В указанном диапазоне находятся следующие символы: '+ s)'''

'''b = str(len(a))
print('В строке ' + b + ' символов')'''

'''c = input('Введи текст: ')
print(c)'''

# Форматирование строк
a = 'sobaka bivaet kusachei'
print(a.title())
print(a.upper())
print(a.lower())
print('--------------------------------------------------------------------------------------')
print("Это первая строка\nЭто вторая строка\nЭто третья строка")
print('--------------------------------------------------------------------------------------')
print("Messages:\n\tMessage1\n\tMessage2\n\tMessage3\nTHE END")
print('--------------------------------------------------------------------------------------')
b = "       , baba  Vera .             "
print(b)
b = b.strip() # Стирает пробелы справа и слева (rstrip - справа, lstrip - слева)
print(b)
b = b.strip(".") # Стираем точки
print(b)
b = b.strip(",") # Стираем запятые
print(b)
b = b.strip()
b = b.title()
print('Конечный результат форматирования: ' + b)
