#Методы работы со списками
# append - добавляет элемент в конце списка
a = ['one', 'alo']
a.append('stttt')
print(a)

# insert - добавляет элемент в указанную позицию
a = ['one', 'alo']
a.insert(1, 'srt')
print(a)

# extend - добавляем больше одного элемента в список
a = ['one', 'alo']
b = ['usr', 'lib', 'sin']
a.extend(b)
print(a)

# index - возвращаем индекс элемента
a = ['dsg', 'sgdjsk', 'qwqe', 'oot', 'tyre', 'qwe', '5', '3', '9', '0', '123', '4', '6']
print(a.index('qwe'))

# pop - удаляем элемент, можно также использовать remove, del.
a = ['dsg', 'sgdjsk', 'qwqe', 'oot', 'tyre', 'qwe', '5', '3', '9', '0', '123', '4', '6']
rm = a.pop(9)
print(a)
print(rm)



'''# sort - сортирует список в возрастающем порядке
a = ['dsg', 'sgdjsk', 'qwqe', 'oot', 'tyre', 'qwe', '5', '3', '9', '0', '123', '4', '6']
a.sort()
print(a)'''

'''# reverse - переворачивает список
a = ['dsg', 'sgdjsk', 'qwqe', 'oot', 'tyre', 'qwe', '5', '3', '9', '0', '123', '4', '6']
a.reverse()
print(a)'''



#Практика!!!
# Задача № 1. Вывести все элементы меньше 5.
'''SP = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
a = []
for i in SP:
    if i < 5:
        a.append(i)
print(a)'''

# Задача № 2. Нужно вернуть список, который состоит из элементов, общих для этих двух списков.

'''a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
c = []
for i in a:
    for k in b:
        if i == k:
            c.append(i)
print(c)'''
